import asyncio
from telegram import Update
from telegram.ext import ApplicationBuilder, MessageHandler, ContextTypes, filters
import random

BAD_WORDS = ['آشغال', 'عوضی', 'بی ناموس', 'جاکش', "کسکش", "خارکسده", "کونی", "کونده", "کسده", "جنده", "مادر جنده", "مادر خراب", "دیوث", "گوزو", "ریدی", "گاییدی", "گایید", "فاحشه", "فاهشه", "جنده پولی", "کس کش", "جا کش", "کو نی", "مادر سگ", "تخم سگ"]
warning_texts = ["ای بابا، ادب رو رعایت کن", "عه ، بی ادبی نکنید", "لطفا به هم دیگه احترام بزارین", "لطفا احترام یکدیگر رو رعایت کنید", "اوه! ، مودب باشین"]
    


FALLS = [
    "کار هایی که ساده می نمود یکباره دشوار گشت ، تلاش و زحمت شما کمتر نتیجه بخشید ، اشتباهات شما هم مزید بر آن شده حالا فقط با صبر و برد باری و دقت میتوانی کارهایت را سامان بخشی",
    "نگاه کن چه فاصله ای بین راه راست و کاره دنیا افتاده، دوران همبستگی ها و متحد بودن تمام شده، امروز پشت هر زیبائی دامی است ، و دشمن معنی صافی و پاکی دوستی را نمی فهمد ، مواظب باش و دنبال حقیقت باش و برای یافتنش آرام و قرار نداشته باشه",
    "سعی کن از چیز هایی که داری  لذت ببری و تن سالم و عقل سالم بهتر از مال است ، سعی کن به پند بزرگان گوش کنی که موفقیت و سعادت در پندپیزی است و هرگز شر کسی را فاش مکن",
    "از اشخاص بخیل و حسود دوری کن و به درگاه خداوند دعا کن و سحرخیز باش تا بتوانی اشتباهات گذشته را جبران کنی و به موفقیت برسی",
    "دلی پاک و قلبی پاکتر دارید ولی مردم از دل شما خبر ندارند و شما را به خوبی نمی شناسند و این باعث ناراحتی شما می شود و شما با کوشش و مدارا و لطف خداوند موفق می شوید",
    "از مردم انتظاری نباید داشته باشی فقط می توانی با اخلاق خوب آنها را راضی نگهداری تا کمک حالت باشند ، البته باید دقت کنی که کسی سرت هم کلاه نگذارد ، اگر دانا و هوشیار باشی موفق خواهی شد",
    "سعی کن با رفتار صحیح غم های روزگار را از دلت بیرون کنی ، شاد باش و رخت سیاه از تنت بدرار ، به کار مشغول شو و از انجام کار های کوچک پرهیز کن تا از آه و ناله به دور باشی ، هرگی پی محرم اسرار نباش و صبر و تحمل داشته باش به آرزویت میرسی",
    "راه حال مشکل خود را از کسی بخواه که تو را درست راهنمایی کند، از کار های بیهوده بر خذر باش افراط و تفریط باعث شکست می شود ، قدر دوران جوانی خود را بدان و سعی در نام نیک کن ، اگر خیال ازدواج داشتی درنگ مکن و بازیر دستان مهربان باش ، موفقیت تو حتمی است",
    "شما آدم بی آزاری بوده اید ، بار دیگر زندگی بر وقف مراد شما می گرددو شما باید قدرش را بدانید و از آن به خوبی بهره مند شوید ، به دنبال مال دنیا و تجمل مباش ، چون خودش به طرف تو میاید ، با گذشته تاریک خداحافظی کن و از مردم دوری مکن",
    "اگر فک میکنی راه درستی را انتخاب نکرده ای مایوس نباش و فکر نکن که تقدیرت همین است ، دلسردیرا کنار بگذار دوباره از اول راه دیگری را برگزین و سعی کن آینده را بسازی ، حتما موفق می شوی",
    "به آن چیزی که در تو هست خیلی اعتقاد داری و منتظر اشاره ای از او هستی تا جان را فدا کنی ، دوست داری دوست داشتن تو را همه بدانند و با دعا و کوشش به آنچه که می خواهی میرسی",
    "کار ها بر وفق مراد شما می شود، از چیز هایی که بی خبر بودید آگاه می شوید. به زندگی عشق بورز و دوست داشته باش ، به فکر ناملایمات مباش ، دوستان خود را از یاد مبر ، ازدواج سعادتمندی خواهی داشت",
    "انگار دوباره متولد میشوی ، زندگی ات بهشت میگردد ، بر روی تخت زمردین شانس نشسته ای و به هوش باش تا نهایت استفاده را از نعمتهای خداوند که به تو روی آورده ببری",
    "شما به موفقیت و سعادت رسیده ای و باز هم خداوند به شما لطف می کند و خدا با شماست ، آنچه را که می جویی به کمک خدا می یابی ، مسافرت برای شما شانس می آورد در ازدواج و پیوند با فرد مورد علاقه ات درنگ مکن",
    "کسی را دوست داری ، میان تو و او فاصله ای است و نمی توانی عشقت را ابراز کنی در هر صورت در عشق صاحب تجربه می شوی ، ناراحت مباش ، عاشق با تجربه دل معشوق را نرم می کند ، حتما به مراد دلت خواهی رسید",
    "حسودی مکن و از حسودان دور باش ، از زندگی با امید بهره مند شو و به زیبائیهایی زودگذر فکر مکن ، هرچه برایت پیش میاید بپذیر و تحمل کن چون خوشبختی در انتظارت می باشد",
    "با تند خویی و بد اخلاقی ، یاران و افراد مورد علاقه ات را از دست می دهی ، بدان که غریبه برای شما غمخواری نمی کند، به دنبال آرزوها و کارهای محال و دور از دسترس مباش و به واقعیت ها بیاندیش و تلاش کن، کارها روبراه می شود",
    "سختی هایت به پایان رسیده ، زمان کامروائی و خوشی در انتظارت است ، حالا تو خوب ارزش های خوش را می فهمی پس تا وقت از دست نرفته یادی از افتادگان و ضعفا کن و سعی کن آنها را در موفقیت خود سهیم کنی ",
    "حرف حق را باید قبول کرد در غیر این صورت جهل است و فتنه که هیچ چیز را قبول نمی کند، تو خود نمی دانی مه چه می خواهی ، ساکتی ولی درونت پیوسته و پر تلاطم است با اینکه زیاد به مال دنیال علاقه نداری ، اما پیوسته در تلاشی و به ندای درونت گوش می دهی ، اگر جهل نکنی ، نبوغ تو شکوفا می شود",
    "هیچ وقت فکر مکن که میتوانی آدمی پیدا کنی که پاک و معصوم باشد ، چون هرکسی که در این دنیا زاده شده  هم خوبی و هم بدی دارد ، درد دلت با کسی بگو که تو را بفهمد نه کسی که بیهوده سرزنشت کند . مشکلات تو با عقل و درایت حل می شود ، هرگز خود را شکست خورده ندان",
    "اگر کاری رل که فکر می کنی درست است ، انجامش بده و به حرف دیگران و ملامت دوستان گوش نده ، باید با جدیت گره های کارت را بگشایی",
    "برای رسیدن به موفقیت راه درازی در پیش نداری ، به تلاش خودت برای بهتر زیستن ادامه بده ، وسوسه مال دنیا اعصاب آدمی را مختل میسازد ، سعی کن به آن فکر نکنی چون آینده ات روشن است و نیازی به مال دنیا نداری",
    "اگر دلسرد نشوی و دوباره شروع کنی هرچند که عمرت قدری تلف شده و آن موفقیت اول را نداری ولی باز مطمعن باش که به خوشبختی و موفقیت می رسی",
    "مشکلاتی برایتان پیش آورده اند ولی فهمیده اند که بیگناه هستید ، سعی می کنند شما را راضی کنند ، از فتنه جو ها دوری کنید و رضایت بدهید هر چند که با خودتان عهد بسته اید که رضایت ندهید اما تقدیر را بپذیرید و کدورت را کنار بگذارید",
    "جوانی و بی خبری ، پیری و مرگ ، دنیا برای همه یکسان است ، باید بدانی که نابرده رنج گنج میسر نمی شود ، پس به هست و نیست دنیا فکر نکن تا بهتر زندگی کنی و خوش باشی چون خوشی هم با تلاش میسر می شود ",
    "سعی کن به مردم بفهمانی که از شما توقع بیجا نداشته باشند ، زیرا شما خود دنبال مال دنیا نیستید و به آن پشت کرده اید ، به دنبال رضای خدا و کسب معنویات هستید",
    "برای تو آرزوی موفقیت کرده اند ، اگر در کارت موفق نشدی به آنها پرخاش مکن ، آنها مقصر نیستند و گناهی ندارند ، اشتباه خودت بوده مجددا با فکر باز شروع به کار کن ، انشالله موفق می شوی",
    "چون در کار هایت شکست خورده ای ، از تلاش مجدد خودداری می کنی ، و به کار بی اعتنا شده ای ، از تنهایی نترس و به دنبال شریک برای خود مباش ، و از خداوند مدد بجو ، موفقیت تو حتمی است",
    "موقع رسیدن به آرزو ها و موفقیت است ، دست دشمنانت کوتاه گشته ، راه پیشرفت شما باز است ، غفلت مکن ، دنبال کارت باش ، به امید خدا موفق می شوی",
    "به هر سو که می روی درها به رویت بسته شده ، هرچه فکر میکنی چاره ای برای گشودن مشکل پیدا نمی کنی ، باید کار و فعالیت کنی و صبر و تحمل داشته باشی تا مشکلات رفع شود ، صبور باش به امید خدا موفق می شوی",
    "کارهایت به سر و سامان می رسد و بخت و اقبال به شما رو می کند ، به حرفهای دیگران زیاد اهمیت ندهید ، شما پیگیر کار های خودتان باشید",
    "به هت و پشت کار خود متکی باش و هرگز اظهار ناتوانی مکن ، وقتی کاری از دست خودت برمی آید چه نیازی به کمک دیگران داری  اول به خدا بعد به خودت امیدوار باش ، از مدعیان بی مایه که وعده های پوچ میدهند دوری کن",
    "شما خیلی خوش اقبال هستید ، مطمعن باشید که در هرکار و هرجایی خداوند متعال با شما همراه است ، و موفقیت های چشمگیری در انتظار شماست",
    "هرگز حرف اشخاص فضول را قبول مکن ، در فکر کار خودت باش و به فکر نعمتهایی که در آینده نزدیک نصیب شما می شود فکر کن ، موفقیت های بسیاری در انتظارت است",
    "به دنبال آمال و آرزو های پوچ و دور از دسترس مباش و به دنیا اطمینان مکن ، از هر فرصتی نهایت استفاده را کن ، غم مخور و حسرت مال دنیا را هم مخور ، موفق می شوی ، به امید خدا",
    "حسادت ورزیدن ، غم و غصه خوردن ،و نشستن چاره کار تو نیست ، هیچ عاشقی بدون تلاش کامروا نگردیده است ، موفقیت تو به وسیله کار و تلاش حاصل می گردد ، اگر همت کنی شانس با تو است ، به امید خدا",
    "عزیزی از شما دور می شود که شما را بسیار ناراحت و بی تاب می کند ، تن به تقدیر بدهید صبر داشته باشید ، روز وصل می رسید ، هرچند که قدری دیر باشد",
    "آفرین بر تو که بی نیازی ، و به مال و منال دنیا اهمیت نمی دهی ، اما باز مردم به تو حسادت و بد رفتاری میکنند ، ناراخت مباش برای رفتار مردم اهمیت قائل مشو که تو موفق و کامروا می شوی",
    "به چیزی که نیازمندی برایت مهیاست، قدری تحمل داشته باش ، غم و غصه را از خود دور کن راه ها به رویت باز می شود",
    "نباید برای رسیده به موفقیت به کاری دست بزنی که ممکن است یک وقت برای آن کار بهای سنگینی بپردازی ، به چیزهایی که داری اکتفا کن ، و در اثر زیاده روی از راه راست منحرف مشو و زیاد به جوانی و طول عمر متکی مباش که هر بهاری خزانی دارد",
    "اعمالت طوری میباشد که کسی از کارت سر در نمی آورد ، اگر به کسی آسیب نرسانی و در کارهایت به خداوند توجه داشته باشی ، موفق می شوی",
    "ساده بودن در زندگی خوب است ، انسان در سادگی بهتر لذت می برد و به نفس خود مسلط است ، همانطور که عاشق امیدوارتر و فعال تر است ، بهتر از لذاتی که انسان در سادگی می برد ، چیزی در دنیا وجود ندارد",
    "اکنون که در راه موفقیت قرار گرفته ای همه به تعریف و تمجید تو پرداخته اند ، از اشخاص تنگ نظر دوری کن که همه آنها به دنبال مال و مقام و موفقیت تو هستند",
    "دنبال دوست بی ریا باش که دوست خوب کمیاب است ، از حرف های بدون عمل پرهیز کن ، دنیا پایدار نیست هرچه که در دنیا می بینی فانی و رفتنی است ، فقط محبت و کار های خوب توست که می ماند",
    "زندگی تو پر از موفقیت و کامروائی خواهد شد ، به قدری نعمت تو زیاد می شود که دیگر از همه چیز بی نیاز می شوی ، خبر های خوشی به دستت خواهد رسید ، آسوده خاطر باشید که خوشبختی تا آخر زندگی با تو است",
    "شما میدانی که وقتی آدمی با حقیقت آشنا شد ، اگر غیر از آن به هر راه دیگری برود ناموفق است ، پس هرگز از راه راست منحرف مشو و با اعتدال قدم بردار  ، مطمعن باش موفقیت تو حتمی است",
    "سعی کن قدر روز های خوب را بدانی و از دنیا بهره مند شوی ، بدان که نام نیک و کار نیک در جهان می ماند ، همه ما فانی هستیم ، از ظلم و بدی نسبت به همنوع و زیردستان خود بپرهیز",
    "در بی نیازی و درویشی بهشت را می یابی ، پس به مال و منال دنیا نیاندیش که همه چیز پول و ثروت نیست و قدری باید به معرفت دنیا توجه داشته باشی",
    "به کسی علاقه مندی و به او قول داده ای و بر سر عهد و وفای خودت ایستاده ای ، می ترسی که او پایبند نباشد ، دلسرد مشو کارها درست می شود ، دست از فعالیت و امیدواری برندار",
    "امیدوار باش که در عضق موفق خواهی بود و به وصال می رسی ، فامیل و بستگان تو وقتی او را دیدند به تو حق می دهند ، که شیفته اش هستی ، زندگی خوشی را در پیش رو داری",
    "آرزو ها و خواسته های بسیاری در سر داری ، از دوری عزیزی رنج می بری ، ثابت قدم باش به مقصود خواهی رسید ، موفقیت و پیشبرد کارها فقط در جهد و پایداری و مقاومت شما به دست می آید",
    "بدان خداوند بر تو امیدوار است ، دعای تو را مستجاب می کند ، ناشکری مکن ، از خدا بخواه تا تو را در راهی که می روی موفق کند",
    "به کسی علاقه مندی و او را دوست داری ، برای به دست آوردنش نیاز به پول داری ، به همین دلیل فکر می کنی که از کسین دیگر کمتری ، دلسرد مشو ، تلاش کن به امید خدا به یارت می رسی",
    "در درگاه خداوند، فرزند انسان پولدار و بی پول و کافر و دیندار ، همه در زمان تولد یکسان هستند ، این اعمال بعدی ما می باشد که مقام و رتبه ما را در پیشگاه الهی مشخص می سازد ، پس هرگز مردم آزاری مکن",
    "به کسی علاقه داری که بر اثر پیش آمدی از تو دور می شود و تو ناراحت می شوی و نمی دانی دردت را با که در میان بگذاری ، جرات به خرج بده شاید گره از کارت گشاده شود",
    "قلب تو مملو از محبت و دوستی است ، تو به درگاه خداوند عزت داری ، حق شناسی و پایداری ات در دوستی زبان زد خاص و عام است ، موفقیت تو حتمی است",
    "شخص مورد علاقه ات را رنجانده ای و از دوری اش ناراحت هستی ، سهی کن با مهربانی و ملاطفت عمل خود را جبران کنی ، به امید خدا موفق می شوی",
    "اگر می خواهی موفق شده و در میان مردم انگشت نما شوی ، سعی کن در دوستی ثابت قدم باشی ، زیرا موفقیت تو در اتحاد و دوستی خالصانه میسر می شود ، پس بی وفایی را کنار بگذار",
    "خبر هایی خوشی از جانب عزیزی به شما میرسد که در موفقیت شما بسیار اثر می گذارد و تمام غم هایت را از دل می برد و به زندگی امیدوارتان میکند",
    "کسی را دوست می داری که فکر میکنی که بدون او زندگی برایت میسر نیست ، تردید داری که آیا او هم تو رو دوست دارد یا نه ، تو خود را هم ردیف او نمی دانی و نا امیدانه به او عشق می ورزی ، اما نا امید مباش این امر امکان پذیر است",
    "شما دوستی بسیار فداکار و ثابت قدم هستی ، انقدر که فکر دوستان هستید به فکر خود نمی باشید ، قدری هم به خود فکر کنید ، موفق می شوید",
    "شما خیلی زود و در سن پایین مورد تحسین قرار می گیرید ، هرگز دچار کبر و غرور نشوید و فخر فروشی نکنید ، سعی کنید مردم دار باشید ، زیرا همانطور که ثروت ماندنی نیست شهرت هم برای همیشه نمی ماند ، مگر با مردم داری",
    "شما دارای هوش و استعداد سرشاری هستید که شاید خودتان هم نمی دانید ، اگر دنبال کار های بیهورده نروید و به واقعیت ها فکر کنید متوجه پیشرفت خود خواهید شد",
    "اگر سعی کنی مطابق خواست خداوند قدم بداری و خود سری و غرور را کنار بگذاری ، آن وقت مطمعن باش دنیا و آخرت بکامت شیرین می شود ، و از آن میتوانی خوب بهره مند شوی",
    "در زندگی نا امید مباش ، صورت زیبا و قشنگ دلیل بر موفقیت و خوش شانسی نیست ، کسی که دارای علم و هنر است برای جامعه ارزش بیشتری دارد ، برای کسب علم و هنر بکوش تا در صدر قرار گیری",
    "از جا بلند شو و تلاش کن ، خود را از پا مینداز ، ناله و زاری بیفایده است ، از اول شروع کن با شهامت در مقابل ناملایمات بایست ، که در این صورت میتوانی موفق و کامروا باشی",
    "هرچند انتظار شما طولانی بوده است ، ولی خوشحال باش که دیگر انتظار به پایان رسیده و به زودی به دیدار معبود و یار نایل می گردی",
    "جاذبه های دنیا ، دل هرکسی را برده و کسی نیست که گول این ضواهر فانی را نخورده باشد ، به دنیا دل نبند ، ناراحت مباش ، با امید از نو شروع کن ، انشالله موفق می شوی",
    "شما در کارها موفق و انگشت نما می شوید و دست به هرکاری میزنید مورد قبول جامعه و عموم می باشد ، به خود مغرور نشوید و از کم اعتنایی نسبت به دیگران بپرهیز ، تا مردم بیشتر به شما علاقه مند باشند",
    "از کسانیکه بدون اطلاع و غلظ شما را راهنمائی میکنند دوری کن ، زیرا آنها نمی توانند تو را درک کنند ، و بفهمند که دارای چه نبوغی هستید ، مشاور دنیا دیده انتخاب کن ، با همت و عقل و درایت بکوش ، حتما موفقیت از آن تو است",
    "شما در مسیر پیشرفت قرار گرفته ای ، در کارت لحظه ای درنگ مکن و تردید نداشته باش ، که در کار خیر و درست هیچ حاجتی به مشورت و راهنمائی نداری، زیرا که ممکن است بعضی از روی نادانی و یا از روی حسد شما را راهنمائی غلط بکنند",
    "کار دنیا بی وفائی است ، کسی هم نیست که از کار دنیا راضی شده باشد ، عشق ورزیدن به دنیا بهر حال در نهاد آدمیان میباشد ، پس سعی کن بدون هیچ درد و غمی از دنیا بهره مند شوی",
    "بدان که عمر آدمی محدود است ، برای پیشرفت و موفقیت راه باز است ، وقت را از دست مده و زمان را بیهوده تلف مکن ، کوشش کن به امید خدا موفق می شوی",
    "چرا فکر میکنی خداوند در مورد تو ظلم کرده است ، او از حال تو با خبر است ، درست به زندگی خود فکر کن ، امروز چوب اشتباهات خودت را میخوری ، پس حالا که تن سالم داری ، این از لطف خداوند است ، با کار و کوشش گذشته را جبران کن ، به امید خدا تلاش تو بی ثمر نمی ماند",
    "یکبار دیگر هم دنیا به تو رو میکند و این آخرین فرصت تو است ، پس سعی کن اشتباهات گذشته را تکرار نکنی ، با عقل و درایت از فرصت پیش آمده استفاده کن ، خداوند همراه خردمندان است",
    " برای به دست آوردن مقصود و رسیدن به موفقیت نباید با دیدن ناملایمت ها نا امید شوی ، دست از فعالیت خود برندار ، هرکه طاووس می خواهد ، جور هندوستان باید کشد ، با تلاش و کوشش و امید به خداوند به مقصود خود خواهی رسید ",
    "اشتباه شما باعث شده که مورد سرزنش دیگران قرار بگیری ، تلاش و کوشش کن ، این اشتباهات همه تجربه میشوند ، به امید خدا به موفقیت میرسی",
    "از ایراد ها و ناخوشنودی مردم و اطرافیان در مورد کاری که شروع کردی ناراحت و مایوس نشو ، کار شما مربوط به شماست ، عواقب آن ضرر و سودش بجز شما به کسی دیگری نخواهد رسید ، فعال باش موفق میشوی",
    "خداوند در های رحمت را به روی شما میگشاید و دنیا را برایت چون بوستان میکند و شما غرق در لذت و شادی می شوی ، سعی کن در آن موقف به فکر دیگران و زیر دستان هم باشی ، تا خداوند رحمتش را از تو دریغ نکند",
    "برای اینکه مورد مهر و محبت مردم جامعه قرار گیری ، از کفتن حرف های نیش دار و تند پرهیز کن ، با زبان نرم و مهربان نظر افراد را به خود جلب کن",
    "ناراحتی ، زیرا کسی را که دوست داشتی از پیش شما رفته و از دوری او ناراحت و غمگین هستید ، افسوس را کنار بگذار و تلاش کن تا بوسیله کار غمهایت فراموش گردد",
    "قبل از اینکه فرصت به دست آمده از دستت برود از آن نهایت استفاده را سعی کن ببری ، اگر غفلت کنی و هوشیار نباشی دیگر جبران آن برایت مقدور نیست",
    "از انتقام جویی دست بردار و دشمنانت را به حال خود بگذار ، وقت برای تو بیش از انتقام جویی ارزش دارد ، سعی کن در راه تحصیل خواسته هایت تلاش کنی ، زیرا تو انسانی موفق خواهی شد",
    "مشکلات کار شما از بین می رود و لطف خداوند به شما رو می کند ، روحیف پیدا میکنید و دوباره با همین انرژی گذشته به فعالیت ادامه می دهید",
    "شما آدمی احساسی هستید که دارای اخلاقی خوب می باشید ، لذا مورد توجه مردم قرار گرفته اید ، مبادا خودپسند شوید که این عمل موفقیت شما را به مخاطره می اندازد",
    "حاصل کار و تلاش خود را راحت از دستی می دهی ، عمری که صرف آن کرده ای بیهوده تلف شده ، از حالا سعی کن جبران مافات کنید ، و دیگر از بیهودگی دست بردار تا موفق باشی",
    "از فراق عزیزت می سوزی که نمی توان آن را بیان نمود ، ناراحت مباش که به زودی از او خبری به دستت می رسد و به احتمال زیاد در آینده نزد یکدیگر خواهید بود",
    "امروز که گرفتاریهای زیاد به تو روی آورده نا امید نباش و از تلاش دست برندار و منشین تا دیر نشده کوشش کن تا از چنگال گرفتاری نجات پیدا کنی ، اگر دیر شود دیگر گله و شکوه فایده ای ندارد",
    "به صورتی که برایت غیر قابل قبول است ، دارای ثروت و مکنت می شوی ، به شکرانه این لطف الهی میبایستی دست مردم افتاده را بگیری که در آن صورت برکتت بیشتر خواهد شد",
    "شما گرفتار و دردمندید ، به شما مژده می رسد قدری صبر کنید و با گرفتاریها بسازید ، لطف خداوند شامل حال شما میگردد ، تمام ناراحتی ها برطرف می شود و غم و اندوه دیگر به جانب شما نمی آید",
    "شما بسیار آدم یکه شناسی هستید و برای به دست آوردن کسی که دوست می دارید به همه گونه در تلاش و جهد می باشید ، ولی بدانید که کارهایی باعث کوچک شدن شما می شود ، پس از آنها پرهیز کنید",
    "از زحمتهایی که برای دوستان کشیده اید ، قدردانی نکرده اند ولی باز شما سعی کنید و به جای دشمن دوستان را نگهدارید ، ولی بدانید که امروزه دوستان خوب کمیاب هستند ، در پی یافتن یک دوست با زندگی قمار نکنید",
    "شما آدم با احساسی هستید و پیوسته با طبع لطیف خود می سازید ، به دنبال زیبائیها و طبیعت می باشید ، روی هم رفته آدم خوشبختی خواهید بود ، همت کنید ، به امید خدا به موفقیت های بیشتری میرسی",
    "فکر و ذهن شما همیشه به یاد عزیزتان بوده و در راه او غصه خورده اید و هنوز هم به یاد و فکر او زندگی می کنید ، آری هر کسی طالعی دارد و به امید چیزی زنده است ، تقدیر تو هم این گونه بوده است",
    "شما دست به کاری زده اید که ابدا نباید فکر سود و زیانش را بکنید چون در هر صورت چه زیان داشته باشد چه سود ، چون مفید است می بایستی انجام شود",
    "هر چیزی در این دنیا به سادگی به دست نمی آید و بی خیال نباش ، کار دنیا را سرسری مپندار ، در این دنیا به هر چیزی که بخواهی می توانی برسی به شرطی که تلاش و کوشش بکنی",
    "شما به پند و نصایح بزرگان خود عمل کردید و امروز پی به نتایج آن برده اید ، عزیزی از شما دور است که به زودی از حالش با خبر می شوید ، امیداور باشید و غصه نخورید",
    "به یاد آورید روزگار گذشته را که با خوشی و سعادت همراه بود و روزگاری که در سایه همبستگی و محبت و سعادت و شادی در خانواده ها بود ، حال که همه از هم دور شدند و تنها مانده ای به یاد آن زمان به درگاه خداوند دعا کن تا خوشبختی از دست رفته باز گردد",
    "شما پیشرفته زیادی می کنید با خلاق نیکوئی که دارید ، پیر و جوان علاقمند و دوستدار شما می شوند ، دست از خوبی و مهربانی برندار که تنها همین حسن ، شما را به درجات بالا می رساند",
    "بدان در خلقت تو خداوند هیچگونه اشتباهی نکرده است و این خود تو هستی که میبایستی اندازه را نگهداری و متعادل رفتار کنی تا موفق شوی",
    "شما در کمال سلامتی و تندرستی به جاه و مقام و دولت می رسید ، به امید خدا بدان حال خواهی ماند و هیچگونه گزندی به شما نمی رسد",
    "شما مورد توجه و محبت تمام دوستان و آشنایان هستید و آنها سغی می کنند که مبادا آسیبی باعث آزردگی خاطر شما شود ، لذا غرور را کنار بگذار تا همیشه اینگونه مورد مهر و لطف قرار داشته باشی",
    "منتظر هستی تا شخصی به وعده ای که به شما داده عمل کند و انتظار سرآمده و خبری نشده ، هیچ وقت به امید بندگان خدا مباش ، به خدا توکل کن ، و دست همت بالا بزن که موفق می شوی",
    "اتفاقی برای شما رخ داده که در شما ایجاد نیروی مجدد نموده است و دوباره به تلاش و کوشش آمده اید و از این موضوع بسیار راضی هستید",
    "چهره ساده و بی الایش شما باعث می شود که افراد طمع کار از شما سوء استفاده نمایند ، تمام اینها به این سبب است که شما محجوب می باشید ، و مردم را از اشتباه در نمی آورید ، قدری رک با آنها صحبت کنید تا خیالات خاک را از سر بیرون کنند",
    "خداوندی که شما را آفریده به فکر شما هست و از حالتان با خبر است ، نا امید مباش و به خدا توکل کن ، مطمعن باش کارهایت روبراه شده و به مقصود خود خواهی رسید",
    "شما برای رسیدن به کسی که بسیار دوستش داری ، اول باید خودت را درست کنی و بعدا دنبال آن کسی عزیز باش که با سعی و کوشش به آن خواهی رسید",
    "شما به اوج سعادت . نیکبختی می رسی ، سعی کن زیر دستان و دوستان خود را نیازاری که آنها در این سعادت به شما کمک کرده اند ، برای به دست آوردن سعادت و خوشبختی باید با کمال دقت عمل نمائید",
    "کسی را که دارای کمالات و حسن نظر است اطاعت کن و گوش به نصایح دستوراتش بده و تا سر حد امکان از او پیروی کن ، از آدمهای خشک و دانشمند نما بپرهیز که تو را از راه راست منحرف میکنند",
    "زندگی فراز و نشیب زیاد دارد ، درد فراق ، تنهایی و گوشه گیری و اعصاب خوردی های بسیار ، اما نباید نا امید شد ، مطمعن باش زندگی روی دیگر خودش که خوشی و راحتی است را حتما به شما نشان خواهد داد",
    "کسی که سعی کد در زندگی خوش باشد ، پادشاهی می کند ، پس تا می توانی از مال و زیبائیها لذت ببر و سعی کن دل دیگران را هم شاد کنی ، که پادشاهی نتیجه اعمال توست",
    "قلبی مملو از محبت و مهربانی داری ، هرگز از اینکه آزرده خاطرت می کنند ناراحت مشو ، سعی کن از این به بعد با اشخاص فرو مایه از در الفت و مهر در نیایی و به کسی دل ببندی که برای عطوفت و مهر تو ارزش قایل باشئ",
    "شما شدیدا عاشقید ، عشق خوبست زیرا آدمی را فعال می کند و سازنده اما به شرطی که عشق شما هم عاقلانه باشد ، در غیر این صورت عشقی که عقل و تفکر را برباید عاقبت باعث نابودی می شود",
    "فکر زندگی و لذتهای آن باش و از مردم آزاری و مال اندوزی دوری کن ، آن قدر تلاش کن که سعادتمند و راحت زندگی کنی ، مال زیاد به درد نمی خورد ، و گنج قارون هم به مرور زمان بر باد رفته و نابود می شود",
    "شما در خوش فکری و ابتکار نظیر ندارید ، کوی سبقت را ترقی پیشرفت از همه می ربائید ، هرچند در بازار رقابت ترحم معنی ندارد و شما سعی می کنید  با مروت باشید تا در جهت انجام کار خیر به راه خطا و گناه نروید",
    "شما دارای فرزندی می شوید که از خوبی نظیر ندارد ، قدر او را بدانید و بدانید شما را به سعادت کی رساند ، ولو اگر چیزی هم از مال دنیا نداشته باشید چنان راحت هستید که احساس پادشاهی می کنید",
    "خداوند اشخاص وفادار را در هر حال که هستند نگه دار و پشتیبان باشد ، اگر می خواهی که عهد و پیمانت نشکنند ، تو خود نیز عهد شکن مباش ، اسرار دلت به کسی مگو مگراینکه دوست مطمعنی باشد و در راه دوست باوفا و رازدار فداکاری کن ، چون گوهری کمیاب است",
    "عمر زود می گذرد ، مثل باد ، آب حیاتی هم در بین نیست که تجدید عمر شود ، تا فرصت داری کاری بکن و از دوستان خوبت کمک بگیر ، به امید خدا موفق می شوی",
    "هرکس که زیبا و خوش اندام است دلیل بر وفادار بودن و خوبیش نیست ، به کسی دل ببند که زیبائی سیرت را نیز دارد ، مظهر زیبائی و دلبری حور و پری هستند ، اما خوبی و لطفات آن است که یک انسان کار درست داشته باشد",
    "کسی که با عشق و ایمان در زندگی قدم بر می دارد اگر زر و زور هم نداشته باشد ، خدا را که دارد ، شما هم به کار و کوشش و خدا توکل کنید ، انشالله موفق خواهید شد",
    "سعی کن به جای دشمن تراشی برای خودت ، دوستان خوبی پیدا کنی و رفیق شفیق را برای یک شب و چند روز نخواهی ، قدر آن را بدانی که زندگی ادامه دارد و تو نیازمند به دوستان با وفا هستی",
    "دنبال خواسته های واهی و دور از دسترس مباش ، به خدا پناه ببر و اندیشه خطا را از سرت بیرون کن ، از مشکلات و سختی ها نترس که کامیاب خواهی شد",
    "می بینم دست روی دست کذاشته ای و تلاش نمی کنی و برای خود دوست و یاری غمخوار نمی یابی ، تلاش کن که همیشه زندگی آن قدر راحت نیست که نیاز به دوست و همدم نداشته باشی ، آخر باد خزان خواهد وزیدو و تو نیاز به هم صحبت داری پس غافل مباش",
    "شما فریب ظواهر را خورده ای ، توسط ریا و تزویر اسیر گذشته ای ، سعی کن از ریاکاران دور باشی ، بدان که غریبه و بیگانه برای کار کردن بهتر از آشنا و فامیل است ، پس دیگر اشتباه مکن ، به امید خدا موفق می شوی",
    "دعا های شما به درگاه خداوند اثر می بخشد و خدداوند به شما عزت و سعادت می بخشد ، شما نیز باید با جدیت دنبال کار هایت باشی ، به امید خدا به مراد دلت میرسی",
    "باید بدانی که کار غلط ولو با نیت خیر هم که باشد غلط است ، پس هرگز گول اشخاص منحرف که خود را غمخوار تو معرفی می کنند را نخور ، زیرا نصیحت صادقانه را فقط از زبان استاد می توانی بشنوی ، که غمخوار واقعی توست",
    "سعی کنید از ریا و دروغ دوری کنید ، با حقیقت رفتار کنید که آنان که راه حقیقت می روند ، شرمنده نیستند ، و هیچ کس با دروغ به جایی نمی رسد",
    "شما رنجها و مشقات زیادی را تحمل کردی تا به درجاتی رسیده ای ، اما غافل نباش ، حاسدان بلای جان شما هستند ، و از آنها پرهیز نکردی و غافلگیر شدی ، در هر صورت تجربه ای پیدا نمودی ، تلاش کن ، دوباره به موفقیت خواهی رسید",
    "شما تصمیم گرفته اید و عزم را جزم کرده اید که مجددا فعالیت نموده و رفاه از دست داده را کسب نمائید ، برای اینکار می بایستی ثابت قدم باشید و فعال تا موفق شوید",
    "نهایت استفاده را از شما کرده اند و بعد شما را تنها گذارده اند ، و رهایتان نموده انده ، در این دنیا از این گونه افراد بسیارند ، شما باید عاقل باشید که مجددا در دام آنها نیافتید",
    "در صدد تغییر تقدیر مباش که هرچه سعی کنی چیزی را که مقدر است عوض نمی شود ، به مردم خوبی کن ، که عشق و محبت موهبتی خدادادی است ، و خداوند با مهربانان مهربان است",
    "وقتی که موفق شدید و به مقامی رسیدید ، دوستان خود را از یاد مبر ، بدان که دوست خوب نایاب است ، آن را از دست مده",
    "مواظب باش دل به دنیا نبندی که دنیا محل گذر است و تو را هم مانند دیگران به دست فراموشی می سپارد ، حال هر چقدر که خود را به آن وابسته کنی بیشتر گرفتار می شوی ، پس تا میتوانی بدون وابستگی از نعمتهای دنیایی سود بجوی",
    "بارها کوشش و تلاش کرده اید ، ولی در کار موفق نشده اید ، گله و شکایت برای شما مفید نیست ، اظهار عجز نکنید و به کار و فعالیت ادامه بدهید ، عاقبت موفقیت با شماست",
    "زیاد به فکر آینده و وقایعی که می خواهد پیش بیاید مباش ، کارت را به امید خدا شروع کن ، و سعی کن در آن غفلت نکنی ، و بدان که هیچ کس نمی داند خداوند برای آینده چه خواسته و هرگز هم کسی قدرت عوض نمودن تقدیر را ندارد",
    "شما تصمیمی گرفته اید که از کار کناره گیری کنید و خود را بازنشسته کنید ، همه از عمل شما متعجب هستند ، شما به جای اینکار بهتر است از افراد حسود پرهیز کنید ، و به کار خودتان ادامه دهید",
    "از شما چیزی را خواسته اند که دسترسی به آن برایتان مقدور و میسر نیست ، در مورد این مشکل با بزرگان و دنیا دیدگان مشورت کن که مشکل شما حل می شود",
    "برای پی بردن به اسرار موفقیت میبایستی که ریاضت بسیار بکشی ، فکر مکن که غم دل و غصه تو بدون شادی کردن و خوش بودن از بین می رود ، پس هر شادی با رنج به دست می آید و هر رنجی با شادی بر طرف میگردد",
    "وضع عجیبی برای شما پیش آمده ، معلوم نیست چگونه و توسط چه کسی ، چاره ای نداری جز اینکه تقدیر را بپذیری و برای بهتر شدن وضع زندگی ات باید تلاش بسیاری بکنی",
    "شما بر خلاف خواسته خود دست از کار مورد علاقه کشیده ای ، ناراحت مباش که بهتر از آن نصیب شما خواهد شد ، فقط باید کمی هوشیار باشید",
    "به شما خبر های خوش خواهد رسید ، روز های غم و غصه و ناراحتی تمام می شود ، چنان خوشحال و ذوق زده خواهی شد که برای خودتان غیر قابل باور است ، پس منتظر باشید و به دیگر ناراحت مباشید",
    "شاد و خوش باش که بخت تو از همه بالاتر است ، چنان روزگار بر وفق مراد شما هست که گوی سبقت را از همه می ربائی",
    "شما حتما میبایستی به حرف و پند کسانیکه به آینده و زندگی شما علاقمند هستند گوش کنید ، در غیر این صورت موفقیت شما سخت و دور از دسترس است",
    "شما اگر دنبال کارتان را بگیرید به قدری پیشرفت می کنید که عده زیادی از کار شما بهره مند می شوند ، اما مواظب باشید ، به اشخاصی که سنگ جلوی پای شما می گذارند میدان ندهید",
    "برای خودت اهمیت قائل بشو و بدان که این دنیا ارزش غم و غصه را ندارد ، از حوادث زندگی نترس و بدان که زندگی در هر حال بی رحمی دارد",
    "دل خوش دارید که تمام مدعیان کنار زده شدند با دست غیب شما به زودی به وصال خود خواهید رسید و از غم و غصه فارغ خواهید شد",
    "صبح که نور امید از خاور بدرخشد به مرحمت و لطف خداوند درهای نعمت به روی تو گشاده می شود و تو را سعادتمند و خوشبخت می نماید ، غم مخور",
    "در زندگی راه و روشی پیدا کن که از تلاش تو دیگران هم بهره مند شوند ، سعی کن دست افتادگان را بگیری تا در قلب مردم جای داشته باشی",
    "برای موفقیت و پیشرفت در کار با آن ستیز مکن ، صبر داشته باش ، با مشورت و فکر گره از کار خود بگشا و به تقدیر رضا باش که کار دنیا با زور شدنی نیست",
    "ناراحت مباش و از گفته دیگران ملول مشو ، هرکس صاحب نظر نیست و در آن حد نمی باشد که در مورد کمالات شما نظر دهد ، لذا هر گفته ای را جدی نگیر و ثابت قدم باش",
    "برای اینکه به خواسته ات برسی به همین روش ادامه بده ، که پشت کار و ثابت قدمی خوب است ، که فقط همین پشتکار و جدیت شما را به مقصود می رساند",
    "از تهمت های افراد بی مایه و کم مایه هرگز هراسان و ناراحت مباش که هر آدم عاقلی می فهمد که گفته های ایشان تا چه حد صحت دارد ، بنابراین به کارت ادامه بده",
    "گرچه به ظاهر شما روی خوش نشان نمی دهند ولی در باطن نظر موافق با شما دارند ، شما ثابت قدم باش و هرگز از ایشان دست نکش ، به امید خدا به مقصود خواهی رسید",
    "دوست و یار آن کسی است که در غم و شادی با تو همراه باشد ، نه آن کسی که در شادی به دنبالت و در هنگام غم جای دگر باشد",
    "زندگی به شما رو خواهد کرد ، در موقع کامروایی زمان را از دست مده و نهایت استفاده را از آن بکن ، که اگر وقتت از دست برود دیگه باز نمی گردد ، پس هوشیار باشید",
    "شما باید بدانید هر زیبائی ، نازیبائی هم دارد ، شاید زشتی نباشد زیبائی معنایی ندارد ، پس شما بدانید که تنها پیشرفت و مقام نیست بلکه گرفتاری و ناکامی باید باشد تا معنی خوشی درک شود",
    "سعی کن به اعصاب خود مسلط باشی تا بتوانی به درستی تصمیم پرفته و کار را خوب به انجام برسانی ، همیشه از آدمهای حسود دوری کن و از شر آنها به خدا پناه ببر که هر که به خدا متوسل شود موفق است",
    "زندگی شما چنان تغییر می کند که انگار عمر دوباره پیدا کرده اید ، از آن استفاده کن وسعی کن اشتباهات گذشته را تکرار نکنی ، زمانی را از دست نده ، صحبت دوستان را غنیمت بشمار و عزیز بدار و تا میتوانی از نعمات خداوند استفاده کن و قدر دوستان خود را بدان ، به امید خدا به مراد دل میرسی",
    "شما عاشق زیبائی ها هستید و این غریزه در وجود شماست ، شما از لحظات زندگی به نحو احسن لذت خواهید برد ، زیرا این اخلاق خوش ، از اولین روز تولد با شما بوده ، پس دقت کن مبادا به راه باطل کشیده شوی",
    "زمان دوری و مرارت شما و ناگواریهای زندگی به آخر رسیده و از امروز به نیکبختی و خوشی خواهی رسید و از این به بعد سالهای فرخنده ای در پیش داری ، نگران مباش که به مراد دلت هم خواهی رسید",
    "ستاره اقبال به تو رو کرده ، دل خودت را از بدی پاک کن ، و به خدا روی آور که اگر خدا بخواهد ، گدا را شاه می کند ، دنبال کار های بیهوده و افکار باطل مرو که هر کسی رفت پشیمان شد ، کار خوب مثل طلا ارزش دارد ، حتما نتیجه کار خوب را می گیری",
    "گاهی اوقات بعضی از کارها درست از آب در نمی آید و به انتها نمی رسید ، پافشاری نمودن درست نیست ، عمر تلف کردن است ، پس بنابراین با فکر باز دنبال کار باش",
    "دوستانت از اطرافت پراکنده شده اند ، به هر که خوبی کردی بدی دیدی ، دست به هر کاری میزنی نتیحه خوبی نمی بینی ، هیچ کس نمی داند چه حکمتی در مار است ، اگر خدا دری را ببندد ، در دیگری را باز می کند ، به امید خدا باش",
    "کسی که شما را نا امید کرده به زندگی ات بر می گردد و به قدری تلاش می کند که پیش شما نمونه و یگانه شود و شما به درجات بالا خواهید رسید",
    "کاری در پیش داری ، همت کن و قدم بردار ، به تو بشارت داده شده که در کارت موفق می شوی ، فکر خودت را خراب مکن ، بدبینی را کنار بگذار و در کارت مصمم باش ، در زندگی موفق می شوید",
    "عاشق هستی و هیچ امیدی به وصل معشوق نداری ، منتظر اشاره ای هستی ، تا به سوی دلدارت بروی ، حیران و سرگردان شده ای و نمی دانی چه کنی ، امید را خدا از کسی نگرفته پس همت کن که به مقصود می رسی",
    "عاشق هستی و دلت پاک است ، صبر و تحمل داشته باش ، اوضاع روبراه است و دلت را قوی کن ، خدا کمکت می کند و بشارت شادی و خشحالی به تو می دهد ، اگر مثل سرو محکم باشی ، از بار غم آزاد می شوی",
    "خبر های بسیار بسیار خوب و خوشی به شما خواهد رسید ، طراوت و تازگی جایگزین خشکی و خزان زندگی شما می شود ، هرچند که شما کاری کرده اید که خود را مستوجب قهر می دانید ولی زندگی از در آشتی با شما در می آید",
    "روزگار بر وفق مرادت می شود ، نا امیدی را کنار بگذار تا پیروز شوی ، راز خودت را به هیچ کس نگو ، که کسی رازدار نیست ، سعی کن از هرچه داری لذت ببری و حتما به آرزو هایت می رسی",
    "به تو بشارت داده شده که از کسی که انتظار نداری برایت کمک می رسد ، از ناکامی و نامرادی نا امید مشو ، آنچه تقدیر بخواهد همان می شود ، پس به امید کمک خدا از جا برخیز و تلاش کن ، انشالله موفق می شوی",
    "به عهد خود وفا کن ، از کبر و غرور بیجا دست بردار که فرور و خودپسندی باعث دشمن پروری می شود ، به هر چه داری قانع باش ، از بدبینی دست بردار و سعی کن در زندگی عدالت را پیشه کنی ، خدا بندگان عادل را دوست دارد ، اگر چنین کنی به مرادت می رسی",
    "شما گاهی اوقات در کوران زندگی غافل می مانید و ندانستع اعمال ظالمانه ای انجام می دهید ، از خدا بخواهید شما را ببخشد و سعی کنید کنترل کارهایتان را داشته باشید",
    "مژده به شما داده شده که دوران غم و غصه ات تمام شده ، دیگر دوران شادی و خوشی است ، کلید گنج سعادت به دستت می رسد ، از آن خوب مواظبت گن ، در امن و امانی",
    "مشتاق دلدارت هستی ، دل پاک و بی الایشی داری ، به امید کسی نباش و به حرف کسی دل خوش نکن که فقط خودت هستی و همت خودت ، به خدا امیدوار باش که او مشکل گشاست و تو رو به آرزو هایت می رساند",
    "عمرت می گذرد و کاری برای پیشرفت خود نکرده ای ، به نیروی خودت ایمان داشته باش و از جا برخیز ، آن قدر عیب جویی نکن ، خوبیهای دیگران را هم ببین ، درد دلت را با هرکس مگو ، از خدا بخواه به تو نظر لطف کند",
    "برای شما دیگر بهتر از این نمی شود ، آن چیز هایی که آرزو داشتید برآورده می شود ، غمها و غصه هایت از بین می رود ، به عشق خود خواهی رسید و زندگی موفقی خواهی داشت ، تمام اینها به خاطر صبر و تحملی که داشتی ، نصیب شما شده است ، خدا را شکر کن",
    "گرفتاری زیادی داری ، مشکلی برایت پیش آمده که برطرف می شود ، اگر با کسی قهر هستی آشتی می کنی ، کسی را که دوست داری ، تو را دوست دارد ، باید فداکاری کنی تا به مرادت برسی",
    "زندگی بر وفق مرادت می گردد ، از لحظه ها نهایت استفاده را ببر ، از زور بازو برای حقانیت خودت استفاده نکن ، زورگویی را کنار بگذار ، با آرامش با دیگران برخورد کن ، از روزگار لذت ببر و از هر چه داری راضی باش",
    "احساس گناه می کنی ، خدا بخشنده است ، به دیگران کمک کن تا لطف خدا همراهت باشد ، در عشق شکست خوردی یا نا امیدی ولی مطمعن باش که به پیروزی می رسی ، موقعی که فکرش را نمی کنی مرادت برآورده می شود",
    "مرادی داری ، دست به دعا بردار و از درگاه خدا بخواه تا آرزوهایت بر آورده شود ، بخت خفته تو بیدار می شود ، و شانس در خانه ات را می زند ، مراقب باش ، شانس را از دست ندهی ، لطف خدا همیشه شامل حال تو است",
    "غم دنیا پایدار نیست ، رقیب تو هم همیشه موفق نیست ، تو خوش قلبی . پاک دلی خودت را داشته باش ، تا خداوند کمکت کند ، به مراد دلت می رسی و به وصل معشوقت نایل میگردی ، امیدت را از دست مده",
    "خون دلهایی خورده ای، برای به دست آوردن تجربه بسیار خوب بوده ، از غیب ندا رسیده که آرزویت برآورده می شود ، تو به هر حال به مراد دلت می رسی اگر حتی رقیب تو از بین برود ، از دوستی و محبت خودت چیزی کم نگذار ، خدا کمکت می کند",
    "در آرزوی دیدار یارت هستی ، با آه و ناله کردن کاری درست نمی شود ، اگر از خدا یاری بخواهی و خودت هم همت کنی حتما به مرادت می رسی ، خدا کسانی را که ناراضی هستند دوست ندارد",
    "خیلی سختی کشیده ای و ناملایمات زیادی دیده ای ، زندگی برای هرکس به طریقی سخت است ، نا امیدی بدترین چیز است ، سعی کن از کسانی که بدی دیده ای دوری کنی ، وفاداری به کسانی که لیاقت ندارند ، عمر بر باد دادن است ، مطمعن باش خوشی و شادی در پیش داری",
    "تصمیم به کاری گرفته ای ، در انجامش شک نکن و دل به خدا بسپار ، برای کاری که می خواهی بکنی ، همت داشته باش ، اگر نا امید باشی موفق نم شوی ، اگر امید به خدا داشته باشی ، غم به دلت راه پیدا نمی کند",
    "اطرافیانت قدر تو را نمی دانند ، کسی تو را خوب درک نمی کند ، تو بسیار پاک دل و مهربانی و این موهبت را خدا به تو داده ، قدر همین محبت را بدان و مطمعن باش خدا یار تو است ، اگر تو با خدا باشی و به دیگران محبت کنی ، حتی کسانی که بد هستند ، شرمنده می شوند",
    "آدم ساده دلی هستی ، گول دیگران را می خوری ، با خودت در جنگی ، از حالت چهره ات همه به درونت پی می برند ، غصه نخور ، به خدا توکل کن ، فقط خداست که مشکل گشاست ، به زودی گرفتاریهایت پایان می یابد ، و به مراد دلت می رسی",
    "تو بسیار خوب و مهربانی ، اطرافیانت تو را دوست دارند ، جایگاه تو انشالله بهشت خداست ، اگر هم از کسی بی وفایی دیدی ، او هم روزی پشیمان می شود ، تو با این قلب پاکت حتما رستگار می شوی",
    "نا امید مباش در هر حال شما هم در مسیری قرار می گیرید که در آن مسیر به آرزو ها و خواسته هایتان جامعه عمل می پوشانید ، تا موقعی که مشکل شما حل نشده باید سعی و کوشش کنید ، انشالله به مراد خود می رسی",
    "اگر در راه عشق و عاشقی دل و ایمانت را بدهی خیلی زود خسته می شوی و قبل از اینکه کار مثبتی بکنی وقت از دست می رود ، پس خیال پردازی را کنار بگذار و با فعالیت و کار و کوشش دنیا را در دستت بگیر ، اگر هر کاری در جایگاه خودش انجام بدهی ، آن وقت است که پیروزی از آن تو می شود",
    "درد دلت را به هر کس مگو ، با کسی درد دل کن که عاقل و دانا باشد ، اگر در انتظار رسیدن به مرا هستی خیلی به آن فکر می کنی ، بدان تا آخر این سال به مرادت می رسی ، چون تمام فرشته های آسمان برایت دعا می کنند",
    "به حرف دیگران گوش نکن و نا امید مشو ، کسانی که به تو نصیحت می کنند و از تو ایراد می گیرند ،  خودشان بدتر از تو می کنند ، خودت عاقلی و خوب و بد را تشخیص می دهی ، خدا به تو عقل داده که خوب را از بد جدا کنی ، اگر دلت را پاک کنی و فقط از خدا کمک بخواهی بدان که به عرض می رسی",
    "اگر دنبال کاری هستی سعی کن به کسی نگویی ، ممکن است در کارت اخلالگری کنند ، کسانی که زبان خوب و روی خوش داشته باشند ، اکثرا پیروزند ، حتی اگر ریاکاری کنند ، پس از بد اخلاقی دست بردار و کار درست را انجام بده ، به امید خدا موفق می شوی",
    "عاشق هستی ، در راه عشق مقاوم باش ، راه درویشان در پیش گیر ، اگر از خودت گذشت نشان بدهی یار را در کمند می اندازی ، با یکدلی و یکرنگی ، موفق می شوی ، در کار هایت صادق باش ، به مال دنیا دل مبند و خدا را از یاد نبر",
    "خیلی نا امیدی ، دست از نا امیدی بردار و دلت را قوی کن ، که کلید هر در بسته ای دعا به درگاه خداست ، از دورویی و تزویر دوری کن ، با روراستی پیش برو ، حرف دلت را راحت بزن تا از صداقت تو مردم با خبر باشند ، خدا پشت و پناهت است",
    "اکنون که جوانی قدر آن را بدان ، لحظات شادی در زندگی هرکسی زیاد است اما آن را نمی بیند ، از هر لحظه خوش زندگی لذت ببر ، از یاد زیر دستانت هم غافل مشو و به ضعیفان کمک کن تا خدا کمکت کند",
    "آگاهای و دانش خود را بالا ببر ، در درون خودت بگرد و اصل خودت را پیدا کن ، آرزو های بزرگ در سر می پرورانی ، این رمز موفقیت است و دل شکسته و نا امید مشو ، امید تو را به هر چه می خواهی می رساند",
    "حسرت گذشته را مخور و زانوی غم در بغل مگیر که هم غم و هم شادی گذراست ، قدر زمان حال را بدان و به فکر بهتر کردن آینده ات باش که حسرت خوردن دردی را دوا نمی کند ، همیشه گفته اند از تو حرکت از خدا برکت",
    "افکار پریشان را از خود دور کن ، هیچ اتفاقی نمی افتد ، کسی نمیداند تقدیر برایش چه در نظر گرفته ، اگر دلواپسی را از خودت دور کنی مطمعن باش موفق می شوی ، و اگر نا امید باشی هر چه داری از دست می رود ، پس به امید خدا همت کن و به پا خیر"#206
]

JOKES= [
    "جفررر ﺍﻭﻣﺪ ﺍﺯ ﻫﻮﺍﭘﯿﻤﺎ ﭘﯿﺎﺩﻩ ﺷﻪ یهو ﺷﻠﻮﺍﺭﺵ ﺍﻓﺘﺎﺩ \nﺩﺍﺩ ﺯﺩ : \nﺣﺎﻻ ﺍﻭﻥ  گلﺧﺎﻧﻮﻣﯽ ﮐﻪ ﮔﻔﺖ\nﮐﻤﺮﺑﻨﺪﺍ ﺭﻭ ﺑﺎﺯ ﮐﻨﯿﺪ ﺑﯿﺎﺩ ﺟﻮﺍﺏ ﺑﺪﻩ ",
    "nیارو داخل هواپیما میره داخل کابین خلبان با تهدید میگه برو فرانکفورت.\nخلبان یه نگاهش بهش میکنه میگه پس اسلحه ات کو؟؟\nیارو میگه رفاقتی برو دیگه حتما باید زور بالا سرتون باشه",
    "جعفر تو اتوبوس یه کشیده گذاشت تو گوش بغل دستیش 🤛\n\nیارو ميگه:چرا میزنی من که چیزی نگفتم\n\nجعفر ميگه: مسیرطولانیه گفتم یه موقع گوه زیادی نخورى!",
    "با شلوارک میری تو آسانسور عکس میگیری لوکیشن میزنی دبی\n\nپشت سرتو نگاه کن نوشته استیل البرز 😐\n\nدر آسانسور بزنه تو کمرت ملعون",
    "هر وقت احساس تنهایی کردی ...\nپاشو يه فيلم ترسناک بزار نگاه کن !!!\nبعد فکر ميکني يکي تو اتاقه، يکی تو آشپز خونه هست، چند نفر هم تو حياطن !!!\nخلاصه از تنهایی در ميای 😂",
    "داروها وقتی میخوان حال یکی رو خوب کنن ، همیشه به شیاف میگن: ما محاصره‌اش میکنیم تو از در پشت وارد شو",
    "دیشب به نامزدم میگم سرم گیج میره همه چیو دو تا می بینم\nمیگه منم دوتا میبینی ؟ \nمیگم اره !\nمیگه خب کدوممون خوشگلتریم ؟",
    "از نظر راننده ها عابراى پياده يه مشت گوسفندن\n\n\nاز نظر عابراى پياده راننده ها يه مشت گاون خلاصه خيابون نيست كه دامداريه",
    "دختره عکسشو با سگش گذاشت اینستا 🐩😍\nپسره با خنده میگه کدومی؟ 😂\nدختره گفت اونی که تورو بغل کرده 😁\nو برای اولین بار پسری در دنیای مجازی، دختری را بلاک کرد\n\nو برای اولین بار پسری در دنیای مجازی، دختری را بلاک کرد",
    "این پیرمردای بالای صدسال که صداسیما میره باهاشون مصاحبه میکنه و میپرسه راز سلامتیتون چیه و اونام میگن پیاده روی و مصرف لبنیات.\nدروغ میگن همشون تریاک میکشن.",
    "حیف نون میره مراسم ختم زن دوستش...\nمیخواد با دوستش اظهار همدردی کنه... نمیدونه چی بگه\nمیگه:\nخدا بیامرزدش، زن تو نبود! زن هممون بود!",
    "مدرسه غلط کرده...\nچیست؟!!!!\nپاسخ منطقی والدین به دانش آموزان در مواجه با تقاضای پول برای مدرسه\nدهه شصتی ها میدونن چی میگم",
    "وقتی پسر و دختر باهم بیرون میرن:\n-این دختره که رد شد خوشگلتر بود یا من؟\n+اون (باختی!پاسخ اشتباه)\n+تو (باختی!پاسخ اشتباه)\n+کدوم دختره؟؟من که ندیدمش(پاسخ صحیح)",
    "یعنی شما بری عطاری بگی دوست پسر ندارم\nهم باز یه گیاهی بهت میده میگه اینو دم کن بخور....\nحل میشه",
    "جَمیله : عزیزم دکتر بهم گفت واسه اینکه حالم خوب بشه باید بریم به سفر خارج به یه ساحل آفتابی\nحالا منو کجا میبری؟\nحیف نون: یه دکتر دیگه!",
    "بادوست دخترم تصویری صحبت ميكردم گف ميخوام باهات چيزيو تجربه كنم كه با هيشكی تجربه نكردم\nگوشيو گذاشت تو يخچال گفت درو ميبندم\nبگو واقعا چراغ خاموش ميشه يانه",
    "دخترا :\nامروز یه نفر بهم دایرکت داد گفت روت کراش دارم \nدوستش : از بس دلبری دیگه\nپسرا :\nممد امروز یه دختر بهم دایرکت داد گفت روت کراش دارم\nممد : من بودم",
    "طرف از یه چایی کیسه ای ۷ تا چایی میگیره\nبعد اومده میگه چجوری میری تو آف لباس میخری\nهرچیزی بنجوله رو دستشون میمونه آف میزنن‌\nنکشیمون  اورجینال",
    "با یه دختر آشنا شدم\nهمش میگفت از پسرهای ورزشکار خیلی خوشم میاد\nدفعه اول با  دوبنده کُشتی  رفتم\nسر قرار منو که دید در رفت\nفکر‌ کنم فوتبالی بود 🤔",
    "حیف نون گردن یکی از مسئولین  اختلاس گر رو بوسید ...\nمسئولِ گفت : همه دست مارو می بوسند تو چرا گردن مارو می بوسی ؟\nحیف نون گفت : جای شمشیر امام زمانو میبوسم",
    "داشتن مدرک تحصیلی تو ایران عین شُرت میمونه …\nداشتنش هنر نیست ولی نبودنش عیبه",
    "غضنفر رفت دستشویی\nیکی داد زد اب داره قطع میشه\nغضنفر هول شد اول کـونشو شست بعد ریــد",
    "دخترای خارج با نگاه، نشون میدن که عاشقت شدن\nولی دخترای ایران چنان نگات میکنن و در گوش هم پچ پچ میکنن\nکه نمیفهمی،خوشکلی ،خوشتیپی ، خشتکت پارس، زیپت بازه یا عاشقت شدن...!",
    "مامان بابام دیشب قهر کردن، بابام صبح اومد آشتی کنه گفت: \nخانوم یه صبحونه به ما نمیدی؟ \nمامانم گفت: \nمگه من نوکرتم؟ \nدوباره یه دعوا شروع شد",
    "رفتیم خواستگاری پدر دختره گفت: از وضعیت مالیت بگو\n\nگفتم برام اصلا پول مهم نیست\n\nبا لباس سفید میام خونتون با لباس سفیدم میرم\nبا قمه افتادن دنبالم بیشورا",
    "فیلم سوپره دختره خواب بود طرف اومد سیر اینو کرد و تموم شد دختره هنوز بیدار نشده بود \nخب کصکش زنگ بزن اورژانس شاید مرده باشه",
    "مورد داشتیم دختره بلد نبوده در پورشه رو وا کنه بیاد بیرون!!!\nتو رودروایسی گیر کرده با پسره رفته شمال",
    "دست یه نابینارو گرفتم بردمش وسط خیابون دوباره برش گردوندم سرجاش\nعینکشو درآورد تو‌چشام نگاه کرد گفت: تو کصکش تری یا من؟",
    "صاب کارم گفته بود برا اینکه خوب بفروشیم \nتیکه کلامت خودم تست کردم، عالیه باشه. \nزنه اومد تو مغازه پرسید آقا اینا کیفیتش خوبه؟ ندید گفتم خودم تست کردم عالیه. \n\nسرمو بلند کردم دیدم نوار بهداشتی رو گرفته دستش",
    "قلمراد میره جبهه بعد از 2 روز برمی گرده. میگن چی شد اینقدر زود برگشتی؟\nمیگه: بابا اونجا به قصد کشت تفنگ بازی می کنن",
    "تو تاکسی زنه تلفنی با شوهرش دعواش شد،\nگوشیو که قطع کرد گفت مردا همه آشغالن، \nراننده زد بغل گفت از سطل آشغال من پیاده شو",
    "دختره ميخواست دوس پسرشو بوس کنه،\nپسره گفت قسم ميخوري که من اولين پسري ام که بوس ميکني! \nدختره ميگه آره بخدا چرا همتون اينو ميپرسين",
    "تو یه جمعی یکی بهم گفت یه کس بگو بخندیم.\nمنم گفتم کس ننت(: \nتا شعاعه 50 متری همه خندیدن غیر خودش \nکسکش فک کرده من دلقکم",
    "ﺩﮐﺘﺮ ﮔﻔﺖ ﭼﺮﺍ ﺳﯿﮕﺎﺭ ﻣﯿﮑﺸﯽ؟؟؟\n ﺩﺭﺩﻫﺎﯾﻢ ﺭﺍ ﮐﻪ ﺷﻨﯿﺪ ﺑﺎ ﮐﻤﯽ ﺗﺄﻣﻞ ﮔﻔﺖ ﺗﺮﯾﺎﮎ ﺑﮑﺶ بدبخت\n ریدم تو این زندگیت",
    "از داعشیه ميپرسن : چرا با ايرانیا نمی جنگید؟\nمیگه : اینا يه فهميده داشتن ... پرید زير تانک !\nواى به حال نفهماشون",
    "نوشته اگه دستت رو محکم گرفت یعنی دوستت داره\nپس چرا من اون سری مامور یگان دستمو محکم گرفته بود بهش گفتم منم دوستت دارم عشقم، اسپری فلفل زد تو صورتم",
    "خدا بیامرز بابابزرگم میگفت وقتی عیالوار بشی باید همه‌ش در بیاری بدی زن و بچه‌ت بخورن \nگفتم آقاجون زن حالا یه چیزی ولی بچه زشته ناموسا\n اونجا بود که سکته دوم رو زد"
]


import aiohttp
from telegram import InputFile
from io import BytesIO

async def generate_image_prompt(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text
    if not text.startswith('/پرامپت'):
        return

    prompt_text = text[len('/پرامپت'):].strip()
    if not prompt_text:
        await update.message.reply_text("لطفا بعد از /پرامپت موضوع عکس را وارد کنید.")
        return

    await update.message.reply_text("در حال ساخت تصویر... لطفا صبر کنید.")

    # نمونه URL فرضی API Polinations:
    api_url = f"https://image.pollinations.ai/prompt/{prompt_text}"

    try:
        async with aiohttp.ClientSession() as session:
            async with session.get(api_url) as resp:
                if resp.status == 200:
                    img_bytes = await resp.read()
                    bio = BytesIO(img_bytes)
                    bio.name = "image.png"
                    bio.seek(0)
                    await update.message.reply_photo(photo=InputFile(bio))
                else:
                    await update.message.reply_text("متأسفانه تصویر ساخته نشد. دوباره تلاش کنید.")
    except Exception as e:
        await update.message.reply_text(f"خطا در ساخت تصویر: {e}")




async def joke_reply(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text.strip().lower()
    triggers = [
        "یه جوک بگو",
        "جوک بگو",
        "جوک",
        "یه جوک",
        "جوک جدید",
        "یک جوک بگو",
        "جوک داری؟"
    ]
    if any(trigger == text for trigger in triggers):
        joke = random.choice(JOKES)
        await update.message.reply_text(joke)




    

async def fall_reply(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text.strip().lower()
    triggers = ["فال", "یه فال بگو", "فال بگو", "فال امروز", "فال جدید", "یک فال"]
    if any(trigger in text for trigger in triggers):
        fall = random.choice(FALLS)
        await update.message.reply_text(fall)








async def welcome(update: Update, context: ContextTypes.DEFAULT_TYPE):
    chat = update.effective_chat
    group_name = chat.title if chat.title else "گروه"
    for new_user in update.message.new_chat_members:
        name = new_user.first_name
        await update.message.reply_text(f"{name} \nبه {group_name} خوش اومدی! هر کاری داشتی بگو")


async def filter_bad_words(update: Update, context: ContextTypes.DEFAULT_TYPE):
    message_text = update.message.text.lower() 

    for bad_word in BAD_WORDS:
        if bad_word in message_text:
            try:
                await update.message.delete()
                print(f"پیام حاوی کلمه نامناسب حذف شد: {bad_word}")

                # انتخاب پیام رندوم
                warning_msg_text = random.choice(warning_texts)
                
                warning_msg = await update.effective_chat.send_message(warning_msg_text)
                
                await asyncio.sleep(3)
                
                await warning_msg.delete()
            except Exception as e:
                print(f"خطا در حذف پیام یا ارسال تذکر: {e}")
            break


async def report_reply(update: Update, context: ContextTypes.DEFAULT_TYPE):
    if update.message.text == "گزارش":
        await update.message.reply_text("✅ گزارش شما ثبت شد #گزارش")

async def send_group_link(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text.lower()
    if "لینک" in text:
        chat = update.effective_chat
        try:
            # گرفتن لینک گروه (ربات باید ادمین باشه و دسترسی داشته باشه)
            invite_link = await context.bot.export_chat_invite_link(chat.id)
            await update.message.reply_text(f"لینک گروه ✅\n{invite_link}")
        except Exception as e:
            await update.message.reply_text("متأسفانه نمی‌توانم لینک گروه را ارسال کنم. لطفاً مطمئن شوید ربات ادمین است.")
            print(f"خطا در گرفتن لینک گروه: {e}")

async def main():
    TOKEN = '7933239688:AAE88fA5gzZxj_wTK1_QQR0pxt4ODSQdPw8' 

    app = ApplicationBuilder().token(TOKEN).build()

    # هندلر عضو جدید
    app.add_handler(MessageHandler(filters.StatusUpdate.NEW_CHAT_MEMBERS, welcome))

    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.PRIVATE & filters.Regex(r'^/پرامپت'), generate_image_prompt))
    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS & filters.Regex(r'^/پرامپت'), generate_image_prompt))

    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS, fall_reply))



    # هندلر پاسخ به گزارش
    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS & filters.Regex(r'^گزارش$'), report_reply))
    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS & filters.Regex(r'^یه جوک بگو$'), joke_reply))

    # هندلر ارسال لینک گروه (باید قبل از فیلتر کلمات باشه)
    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS & filters.Regex(r'^(لینک|لینک گروهو)$'), send_group_link))

    # هندلر فیلتر کلمات نامناسب
    app.add_handler(MessageHandler(filters.TEXT & filters.ChatType.GROUPS, filter_bad_words))

    print("ربات در حال اجراست...")
    await app.initialize()
    await app.start()
    await app.updater.start_polling()

    await asyncio.Event().wait()

if __name__ == '__main__':
    try:
        loop = asyncio.get_event_loop()

        loop.run_until_complete(main())
    except RuntimeError as e:
        print(f"خطا در اجرای ربات: {e}")
